// Напишите программу, которая принимает на вход цифру, обозначающую день недели,
// и проверяет, является ли этот день выходным.

Console.WriteLine("Введите порядковый номер дня недели, чтобы выяснить, является ли он выходным");
int number = Convert.ToInt32(Console.ReadLine());

